This is revision file of advance pandas

In [1]:
import pandas as pd 
data={
    "Name":["Ronit","Rishi","Rahul","Rounak","Tashif","Aditya","Dosa","prasenjit"],
    "Age":[20,21,20,20,20,20,22,20],
    "Salary":[0,10000,0,0,0,0,0,0]
}
df=pd.DataFrame(data)

In [2]:
df["Id"]=[i*10 for i in range(8)]

In [3]:
print(df)

        Name  Age  Salary  Id
0      Ronit   20       0   0
1      Rishi   21   10000  10
2      Rahul   20       0  20
3     Rounak   20       0  30
4     Tashif   20       0  40
5     Aditya   20       0  50
6       Dosa   22       0  60
7  prasenjit   20       0  70

In [4]:
df["New_Id"]=df["Id"]+10

In [5]:
print(df)

        Name  Age  Salary  Id  New_Id
0      Ronit   20       0   0      10
1      Rishi   21   10000  10      20
2      Rahul   20       0  20      30
3     Rounak   20       0  30      40
4     Tashif   20       0  40      50
5     Aditya   20       0  50      60
6       Dosa   22       0  60      70
7  prasenjit   20       0  70      80

In [6]:
df.insert(3,"New_Income",[i*100 for i in range(8)])

In [7]:
print(df)

        Name  Age  Salary  New_Income  Id  New_Id
0      Ronit   20       0           0   0      10
1      Rishi   21   10000         100  10      20
2      Rahul   20       0         200  20      30
3     Rounak   20       0         300  30      40
4     Tashif   20       0         400  40      50
5     Aditya   20       0         500  50      60
6       Dosa   22       0         600  60      70
7  prasenjit   20       0         700  70      80

In [8]:
df.loc[0,"New_Income"]=10000

In [9]:
print(df)

        Name  Age  Salary  New_Income  Id  New_Id
0      Ronit   20       0       10000   0      10
1      Rishi   21   10000         100  10      20
2      Rahul   20       0         200  20      30
3     Rounak   20       0         300  30      40
4     Tashif   20       0         400  40      50
5     Aditya   20       0         500  50      60
6       Dosa   22       0         600  60      70
7  prasenjit   20       0         700  70      80

In [11]:
df.loc[1,"New_Income"]=100

In [12]:
print(df)

        Name  Age  Salary  New_Income  Id  New_Id
0      Ronit   20       0       10000   0      10
1      Rishi   21   10000         100  10      20
2      Rahul   20       0         200  20      30
3     Rounak   20       0         300  30      40
4     Tashif   20       0         400  40      50
5     Aditya   20       0         500  50      60
6       Dosa   22       0         600  60      70
7  prasenjit   20       0         700  70      80

In [13]:
df.drop(columns=["New_Id"],inplace=True)

In [14]:
print(df)

        Name  Age  Salary  New_Income  Id
0      Ronit   20       0       10000   0
1      Rishi   21   10000         100  10
2      Rahul   20       0         200  20
3     Rounak   20       0         300  30
4     Tashif   20       0         400  40
5     Aditya   20       0         500  50
6       Dosa   22       0         600  60
7  prasenjit   20       0         700  70

In [15]:
df.drop(columns=["New_Income","Id"],inplace=True)

In [16]:
print(df)

        Name  Age  Salary
0      Ronit   20       0
1      Rishi   21   10000
2      Rahul   20       0
3     Rounak   20       0
4     Tashif   20       0
5     Aditya   20       0
6       Dosa   22       0
7  prasenjit   20       0

In [17]:
df.loc[0,"Salary"]=0
print(df.isnull())

    Name    Age  Salary
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False   False
4  False  False   False
5  False  False   False
6  False  False   False
7  False  False   False

In [18]:
print(df.isnull().sum())

Name      0
Age       0
Salary    0
dtype: int64

In [21]:
data={
    "Name":["Ronit","Rishi","Rahul","Rounak","Tashif","Aditya","Dosa","prasenjit"],
    "Age":[20,None,20,20,20,20,22,20],
    "Salary":[0,10000,0,None,0,0,0,0]
}
df=pd.DataFrame(data)
print(df.dropna(inplace=True))

None

In [22]:
print(df)

        Name   Age  Salary
0      Ronit  20.0     0.0
2      Rahul  20.0     0.0
4     Tashif  20.0     0.0
5     Aditya  20.0     0.0
6       Dosa  22.0     0.0
7  prasenjit  20.0     0.0

In [23]:
data={
    "Name":["Ronit","Rishi","Rahul","Rounak","Tashif","Aditya","Dosa","prasenjit"],
    "Age":[20,None,20,20,20,20,22,20],
    "Salary":[0,10000,0,None,0,0,0,0]
}
df=pd.DataFrame(data)

In [29]:
print(df.fillna(0,inplace=True))

None

In [30]:
print(df)

        Name   Age   Salary
0      Ronit  20.0      0.0
1      Rishi   0.0  10000.0
2      Rahul  20.0      0.0
3     Rounak  20.0      0.0
4     Tashif  20.0      0.0
5     Aditya  20.0      0.0
6       Dosa  22.0      0.0
7  prasenjit  20.0      0.0